PGM        PARM(&AGENT)

DCL        &AGENT  *DEC  (9 0)

OVRDBF     FILE(CUSTOMER) TOFILE(FLGHT400/CUSTOMERS)
CALL       FRS001 PARM(&AGENT)
DLTOVR     CUSTOMER

ENDPGM
