PGM

DCLF       FLGHT400/FRS411DF

SNDF       RCDFMT(FRSWIN)
SNDRCVF    RCDFMT(FKEYS)
IF         (&IN03)        GOTO END
IF         (&IN12)        GOTO END

SNDRCVF    RCDFMT(FKEYS2) WAIT(*NO)
ENDRCV
DLYJOB     000002
SNDRCVF    RCDFMT(FKEYS3) WAIT(*NO)
ENDRCV
DLYJOB     000003
SNDRCVF    RCDFMT(FKEYS4) WAIT(*NO)
ENDRCV
DLYJOB     000004
SNDRCVF    RCDFMT(FKEYS5)

END:       ENDPGM
