     FFRS001DFCF  E                    WORKSTN      KINFDS WSDS
     FFRCITY  IF  E           K        DISK
     FTOCITY  IF  E           K        DISK
     FFNEXTO  UF  E           K        DISK
     FCUSTOMERIF  F      70 04AI     1 DISK                      A
     FCUSTNAMEIF  F      70 66AI     5 DISK
     FORDERS  O   F      67 09AI     1 DISK                      A
     FFLIGHTSZIF  F     233 09AI     1 DISK
     I*
     ICUSTOMERNS  01
     I                                    B   1   40CNUMBR
     I*
     ICUSTNAMENS  02
     I                                    B   1   40CNNMBR
     I*
     IFLIGHTSZNS  04
     I                                        1   90FFLGHT
     I                                       28  45 FDPCNM
     I                                       46  63 FDYOWK
     I                                       82  99 FARCNM
     I*
     I              X'31'                 C         @F01
     I              X'32'                 C         @F02
     I              X'33'                 C         @F03
     I              X'34'                 C         @F04
     I              X'35'                 C         @F05
     I              X'36'                 C         @F06
     I              X'37'                 C         @F07
     I              X'39'                 C         @F09
     I              X'3A'                 C         @F10
     I              X'3C'                 C         @F12
     I              X'F1'                 C         @ENTER
     I              X'F3'                 C         @HELP
     I              X'F6'                 C         @PRINT
     I*
     I              '0'                   C         @OFF
     I              '1'                   C         @ON
     I*
     I              '0'                   C         @FALSE
     I              '1'                   C         @TRUE
     I*
     I              'ABCDEFGHIJKLMNOPQRST-C         CHARS
     I              'UVWXYZabcdefghijklmn-
     I              'opqrstuvwxyz '
     I*
     I           SDS
     I                                        1  10 @PGM                   _ERR_
     I                                       11  150@STAT                  _ERR_
     I                                       37  390@PARMS                 _ERR_
     I                                       40  46 @MSGID                 _ERR_
     I                                       91 169 @DATA                  _ERR_
     I                                      244 253 @JOBNA                 _ERR_
     I                                      254 263 @USRNA                 _ERR_
     I                                      264 269 @JOBNO                 _ERR_
     I                                      304 313 @SRCF                  _ERR_
     I                                      314 323 @SRCL                  _ERR_
     I                                      324 333 @SRCM                  _ERR_
     I*
     IAPIERR      DS
     I I            256                   B   1   40ERRSIZ
     I I            0                     B   5   80ERRLEN
     I I                                      9  15 ERRMIC
     I I                                     16  16 ERRNBR
     I I                                     17 256 ERRDTA
     I*
     I            DS
     I I            0                     B   1   40MSGCTR
     I I            80                    B   5   80MSGLEN
     I I            'FRSMSGF   FLGHT400  '    9  28 MSGF
     I I            '*INFO     '             29  38 MSGTYP
     I I            '    '                   39  42 MSGKEY
     I*
     I            DS
     I I            0                     B   1   40RMVCTR
     I I            '*         '              5  14 RMVMSQ
     I I            '*ALL      '             15  24 RMVCLR
     I I            '    '                   25  28 RMVKEY
     I*
     IDTTMDS      DS
     I I            '0'                       1   1 DTCENT
     I                                        2   7 DTDATE
     I                                        8  130DTTIME
     I                                       14  160DTMILS
     I*
     I            DS
     I I            '*MDY      '              1  10 CVTDIF
     I I            '*JUL      '             11  20 CVTDOF
     I*
     IINDATE      DS
     I                                        1   20INPTMM
     I                                        3   40INPTDD
     I                                        5   60INPTYY
     I*
     IWSDS        DS
     I                                      369 369 KEY
     I*
     I            DS
     I                                        1  58 FLGHTK
     I                                    B   1   20DSFRL
     I                                        3  18 DSFRC
     I                                    B  19  200DSTOL
     I                                       21  36 DSTOC
     I                                    B  37  380DSDOWL
     I                                       39  54 DSDOWK
     I                                    B  55  580FLGT09
     I*
     I            DS
     I                                        1  24 PRICEA
     I                                    B   1   20PRICEL
     I                                        3   5 PRICEN
     I                                        6  24 BLNK19
     I*
     I            DS
     I                                        1  34 DPTIMA
     I                                    B   1   20DPTIML
     I                                        3  10 DPTIM8
     I                                       11  34 DPREST
     I*
     I            DS
     I                                        1  34 ARTIMA
     I                                    B   1   20ARTIML
     I                                        3  10 ARTIM8
     I                                       11  34 ARREST
     I*
     I            DS
     I                                        1  34 AIRLNA
     I                                    B   1   20AIRLNL
     I                                        3   5 AIRLN3
     I                                        6  34 ALREST
     I*
     I            DS
     I                                        1  66 CUSTKY
     I                                    B   1   20CUSTLN
     I                                        3  66 CUSTNM
     I*
     I            DS
     I                                        1   3 CLASSK
     I                                    B   1   20CLASSL
     I                                        3   3 CLASSN
     I*
     I            DS
     I                                        1  18 SENDSK
     I I            1                     B   1   20SENDSL
     I I            'N               '        3  18 SENDSN
     I*
     I            DS
     I                                        1   8 DSDPTT
     I                                        1   20DSDPHH
     I                                        4   5 DSDPMM
     I                                        7   8 DSAMPM
     I*
     I            DS
     I                                        1  26 TSDPRT
     I                                        1   4 TSYY
     I I            '-'                       5   5 TSDSH1
     I                                        6   7 TSMM
     I I            '-'                       8   8 TSDSH2
     I                                        9  10 TSDD
     I I            '-'                      11  11 TSDSH3
     I                                       12  13 TSHH
     I I            '.'                      14  14 TSDOT
     I                                       15  16 TSMN
     I I            '.00.000000'             17  26 TSREST
     I*
     I            DS
     I                                        1  18 DDPCNA
     I                                    B   1   20DDPCNL
     I                                        3  18 DDPCNM
     I*
     I            DS
     I                                        1  18 DARCNA
     I                                    B   1   20DARCNL
     I                                        3  18 DARCNM
     I*
     I            DS
     I                                        1  18 DYOWKA
     I                                    B   1   20DYOWKL
     I                                        3  18 DYOWKN
     I*
     I            DS
     I I            000000000                 1   90ORDRKY
     I*
     C*
     C           *ENTRY    PLIST
     C                     PARM           AGENT#  90
     C*                                                     * D=DELETE
     C                     RESETFRSADR                      * REFRESH SCREEN -
     C                     EXSR INZSR
     C*
     C           @EXIT     DOUEQ@TRUE
     C*
     C                     WRITEMSGCTL                      * WRITE MSGCTL
     C                     EXFMTFRSADR                      * DISPLAY SCREEN
     C*
     C           KEY       CASEQ@F02      @F02SR            * F02 REFRESH
     C           KEY       CASEQ@F03      @F03SR            * F03 EXIT
     C           KEY       CASEQ@F04      @F04SR            * F03 EXIT
     C           KEY       CASEQ@F05      @F05SR            * F03 EXIT
     C           KEY       CASEQ@F07      @F07SR            * F03 EXIT
     C           KEY       CASEQ@F09      @F09SR            * F03 EXIT
     C           KEY       CASEQ@F12      @F12SR            * F12 CANCEL
     C                     CAS            @ERRCK            * CK FOR ERRORS
     C                     ENDCS
     C*
     C           KEY       IFEQ @F06                        * F03 EXIT
     C           *IN50     ANDEQ*OFF                        * 50 OFF=NO ERRS
     C                     EXSR @F06SR                      * CREATE RECRD
     C                     ENDIF                            * END IF
     C*
     C           KEY       IFEQ @F10                        * F10 PRESSED
     C           *INLR     ANDNE*ON                         * F10 PRESSED
     C           *IN50     ANDEQ*OFF                        * 50 OFF=NO ERRS
     C                     EXSR @F10SR                      * CREATE RECRD
     C                     EXSR @F02SR                      * CREATE RECRD
     C                     ENDIF                            * END IF
     C*
     C                     ENDDO                            * END DO
     C*
     C           END       TAG
     C*
     C                     MOVE *ON       *INLR             * LAST RECORD=ON
     C*
     C*
     C*
     C           INZSR     BEGSR                            * SET OUTPT SCREEN 1
     C*
     C                     SETOF                         39 * UNPROT TIL F6
     C                     SETON                         40 * PROT TIL F6
     C                     SETOF                       3950 * ERROR IND. SC 1
     C                     SETOF                     515253 * ERROR IND. SC 1
     C                     SETOF                     545556 * ERROR IND. SC 1
     C*
     C                     MOVE ' '       MSGID   7
     C                     MOVE *BLANKS   MSGDTA 80
     C                     MOVE @PGM      MSGQUE 10
     C*
     C                     MOVE @FALSE    @EXIT   1
     C                     MOVE @PGM      PGMQ
     C*
     C                     MOVEL20        DOFYR
     C                     MOVE UYEAR     DOFYR
     C                     Z-ADDUMONTH    DOFMON            * SET ERR MESSAGE
     C                     Z-ADDUDAY      DOFDAY            * SET ERR MESSAGE
     C                     MOVE 'X'       COSECO
     C                     MOVE 01        TCKETS
     C*
     C           ENDINZ    ENDSR
     C*
     C*
     C*
     C           @ERRCK    BEGSR                            * CHK INPUT DATA
     C*
     C                     SETOF                       4450 * ERROR IND. SC 1
     C                     SETOF                     515253 * ERROR IND. SC 1
     C                     SETOF                     545556 * ERROR IND. SC 1
     C*
     C                     EXSR @RMVMS
     C*
     C           KEY       IFNE @F10                        * F10 PRESSED
     C           *IN39     CABEQ@ON       CHKRGT
     C                     END
     C*
     C           DOFMON    IFEQ 00                          * RUN INTERACTIVE
     C           DOFDAY    OREQ 00                          * RUN INTERACTIVE
     C           DOFYR     OREQ 0000                        * RUN INTERACTIVE
     C                     SETON                       5051 * SET ERR INDICATOR
     C                     MOVE 'FRS0058' MSGID             * SET ERR MESSAGE
     C                     EXSR @SNDMS                      * SND ERR MESSAGE
     C                     GOTO ERREND
     C                     END
     C*
     C                     MOVE DOFMON    INPTMM            * SET DS MONTH
     C                     MOVE DOFDAY    INPTDD            * SET DS DAY
     C                     MOVE DOFYR     INPTYY            * SET DS YEAR
     C                     MOVELINDATE    DTDATE            * SET DS DATE
     C*
     C                     EXSR @DATCK
     C           DATERR    CABEQ'Y'       ERREND
     C*
     C                     Z-ADD0         DOFJUL  50        * SET ERR MESSAGE
     C                     CALL 'GTOJCV'                    * SELCT START INTRVL
     C                     PARM           DOFMON            * RETURN START TIME
     C                     PARM           DOFDAY            * RETURN START TIME
     C                     PARM           DOFYR             * RETURN START TIME
     C                     PARM           DOFJUL            * RETURN START TIME
     C*
     C                     Z-ADDUMONTH    NOWMM   20        * SET ERR MESSAGE
     C                     Z-ADDUDAY      NOWDD   20        * SET ERR MESSAGE
     C                     Z-ADD2000      NOWYY   40        * SET ERR MESSAGE
     C           NOWYY     ADD  UYEAR     NOWYY             * SET ERR MESSAGE
     C                     Z-ADD0         NOWJUL  50        * SET ERR MESSAGE
     C                     CALL 'GTOJCV'                    * SELCT START INTRVL
     C                     PARM           NOWMM             * RETURN START TIME
     C                     PARM           NOWDD             * RETURN START TIME
     C                     PARM           NOWYY             * RETURN START TIME
     C                     PARM           NOWJUL            * RETURN START TIME
     C*
     C           DOFJUL    IFLE NOWJUL                      * RUN INTERACTIVE
     C                     SETON                       5051 * SET ERR INDICATOR
     C                     MOVE 'FRS0060' MSGID             * SET ERR MESSAGE
     C                     EXSR @SNDMS                      * SND ERR MESSAGE
     C                     GOTO ERREND
     C                     END
     C*
     C           FCITY     IFEQ *BLANKS                     * RUN INTERACTIVE
     C                     SETON                       5052 * SET ERR INDICATOR
     C                     MOVE 'FRS0061' MSGID             * SET ERR MESSAGE
     C                     EXSR @SNDMS                      * SND ERR MESSAGE
     C                     GOTO ERREND
     C                     END
     C*
     C           FCITY     CHAINFRCITY               52     * RUN INTERACTIVE
     C           *IN52     IFEQ @ON                         * RUN INTERACTIVE
     C                     SETON                     50     * SET ERR INDICATOR
     C                     MOVE 'FRS0062' MSGID             * SET ERR MESSAGE
     C                     EXSR @SNDMS                      * SND ERR MESSAGE
     C                     GOTO ERREND
     C                     END
     C*
     C           TCITY     IFEQ *BLANKS                     * RUN INTERACTIVE
     C                     SETON                       5053 * SET ERR INDICATOR
     C                     MOVE 'FRS0071' MSGID             * SET ERR MESSAGE
     C                     EXSR @SNDMS                      * SND ERR MESSAGE
     C                     GOTO ERREND
     C                     END
     C*
     C           TCITY     CHAINTOCITY               53     * RUN INTERACTIVE
     C           *IN53     IFEQ @ON                         * RUN INTERACTIVE
     C                     SETON                     50     * SET ERR INDICATOR
     C                     MOVE 'FRS0072' MSGID             * SET ERR MESSAGE
     C                     EXSR @SNDMS                      * SND ERR MESSAGE
     C                     GOTO ERREND
     C                     END
     C*
     C           FCITY     IFEQ TCITY                       * RUN INTERACTIVE
     C                     SETON                       5053 * SET ERR INDICATOR
     C                     MOVE 'FRS0075' MSGID             * SET ERR MESSAGE
     C                     EXSR @SNDMS                      * SND ERR MESSAGE
     C                     GOTO ERREND
     C                     END
     C*
     C           FLIGHT    IFNE 0
     C                     Z-ADDFLIGHT    FLGTCK  90
     C           FLGTCK    CHAINFLIGHTSZ             45
     C                     MOVE FDPCNM    DDPCNA
     C                     MOVE FARCNM    DARCNA
     C                     MOVE FDYOWK    DYOWKA
     C                     MOVE *BLANKS   DSDOWK
     C                     CALL 'RTDOFW'                    * SELCT START INTRVL
     C                     PARM           DOFMON            * RETURN START TIME
     C                     PARM           DOFDAY            * RETURN START TIME
     C                     PARM           DOFYR             * RETURN START TIME
     C                     PARM           DSDOWK            * RETURN START TIME
     C                     MOVE FDPCNM    DDPCNA
     C                     MOVE FARCNM    DARCNA
     C           KEY       IFNE @F06                        * F03 EXIT
     C           FCITY     IFNE DDPCNM
     C           TCITY     ORNE DARCNM
     C           DSDOWK    ORNE DYOWKN
     C                     SETON                       50   * SET ERR INDICATOR
     C                     SETON                     515253 * SET ERR INDICATOR
     C                     MOVE 'FRS0040' MSGID             * SET ERR MESSAGE
     C                     EXSR @SNDMS                      * SND ERR MESSAGE
     C                     GOTO ERREND
     C                     ENDIF
     C                     ENDIF
     C                     ENDIF
     C*
     C           KEY       IFNE @F10                        * F10 PRESSED
     C           *IN40     CABEQ@ON       ERREND
     C                     END
     C*
     C           CHKRGT    TAG
     C*
     C           FLIGHT    IFEQ 0
     C                     SETON                       50   * SET ERR INDICATOR
     C                     SETON                     515253 * SET ERR INDICATOR
     C                     MOVE 'FRS0021' MSGID             * SET ERR MESSAGE
     C                     EXSR @SNDMS                      * SND ERR MESSAGE
     C                     GOTO ERREND
     C                     END
     C*
     C           CUSNAM    IFEQ *BLANKS                     * RUN INTERACTIVE
     C                     SETON                       5054 * SET ERR INDICATOR
     C                     MOVE 'FRS0065' MSGID             * SET ERR MESSAGE
     C                     EXSR @SNDMS                      * SND ERR MESSAGE
     C                     GOTO ERREND
     C                     END
     C*
     C                     Z-ADD00        CNMCHK  20
     C           CHARS     CHEKRCUSNAM    CNMCHK            * SET ERR MESSAGE
     C           CNMCHK    IFEQ 00                          * RUN INTERACTIVE
     C                     SETON                       5054 * SET ERR INDICATOR
     C                     MOVE 'FRS0066' MSGID             * SET ERR MESSAGE
     C                     EXSR @SNDMS                      * SND ERR MESSAGE
     C                     GOTO ERREND
     C                     END
     C*
     C                     Z-ADD0         COSCHK  10
     C                     Z-ADD0         ADJPRC
     C                     Z-ADD0.00      PRICE             * RETURN START TIME
     C                     MOVE PRICEN    PRICE             * RETURN START TIME
     C           PRICEL    IFEQ 2                           * RETURN START TIME
     C           PRICE     MULT 10        PRICE             * RETURN START TIME
     C                     ELSE
     C           PRICE     MULT 100       PRICE             * RETURN START TIME
     C                     ENDIF
     C           COSFIR    IFNE ' '                         * RUN INTERACTIVE
     C           PRICE     MULT 3         ADJPRC  62
     C           COSCHK    ADD  1         COSCHK
     C                     ENDIF
     C           COSBUS    IFNE ' '                         * RUN INTERACTIVE
     C           PRICE     MULT 2         ADJPRC
     C           COSCHK    ADD  1         COSCHK
     C                     ENDIF
     C           COSECO    IFNE ' '                         * RUN INTERACTIVE
     C                     Z-ADDPRICE     ADJPRC
     C           COSCHK    ADD  1         COSCHK
     C                     ENDIF
     C           COSCHK    IFEQ 0                           * RUN INTERACTIVE
     C                     SETON                       5055 * SET ERR INDICATOR
     C                     MOVE 'FRS0081' MSGID             * SET ERR MESSAGE
     C                     ENDIF
     C           COSCHK    IFGT 1                           * RUN INTERACTIVE
     C                     SETON                       5055 * SET ERR INDICATOR
     C                     MOVE 'FRS0082' MSGID             * SET ERR MESSAGE
     C                     ENDIF
     C           *IN50     IFEQ @ON                         * RUN INTERACTIVE
     C                     EXSR @SNDMS                      * SND ERR MESSAGE
     C                     GOTO ERREND
     C                     ENDIF
     C*
     C           TCKETS    IFEQ 00                          * RUN INTERACTIVE
     C                     SETON                       5056 * SET ERR INDICATOR
     C                     MOVE 'FRS0085' MSGID             * SET ERR MESSAGE
     C                     EXSR @SNDMS                      * SND ERR MESSAGE
     C                     GOTO ERREND
     C                     ELSE
     C                     Z-ADDADJPRC    PRICE
     C           TCKETS    MULT PRICE     PRICE
     C           PRICE     MULT .04       TAXDUE
     C           PRICE     ADD  TAXDUE    TOTAL
     C                     END
     C*
     C           TCKETS    IFGT 10                          * RUN INTERACTIVE
     C                     SETON                       5056 * SET ERR INDICATOR
     C                     MOVE 'FRS0086' MSGID             * SET ERR MESSAGE
     C                     EXSR @SNDMS                      * SND ERR MESSAGE
     C                     END
     C*
     C           ERREND    ENDSR
     C*
     C*
     C           @DATCK    BEGSR
     C*
     C                     MOVE 'N'       DATERR  1         * CLEAR DS TIME
     C                     CLEARDTTIME                      * CLEAR DS TIME
     C                     CLEARDTMILS                      * CLEAR DS MILS
     C                     MOVELDTTMDS    CVTDIV            * MOVE TO VARIABLE
     C                     CLEARCVTDOV                      * Output variable
     C                     MOVE *BLANKS   ERRMIC            * Output variable
     C*
     C                     CALL 'QWCCVTDT'
     C                     PARM           CVTDIF            * Input format
     C                     PARM           CVTDIV 16         * Input variable
     C                     PARM           CVTDOF            * Output format
     C                     PARM           CVTDOV 16         * Output variable
     C                     PARM           APIERR            * API error code
     C*
     C           ERRMIC    IFEQ 'CPF1060'
     C                     SETON                       5051
     C                     MOVE 'FRS0059' MSGID
     C                     MOVE 'Y'       DATERR            * CLEAR DS TIME
     C                     EXSR @SNDMS
     C                     ENDIF
     C*
     C                     ENDSR
     C*
     C*
     C           @RMVMS    BEGSR
     C                     CALL 'QMHRMVPM'                  * PGM TO RMV PGM MSG
     C                     PARM           RMVMSQ            * MESSAGE DATA
     C                     PARM           RMVCTR            * MESSAGE DATA
     C                     PARM           RMVKEY            * MESSAGE DATA
     C                     PARM           RMVCLR
     C                     PARM           APIERR
     C                     ENDSR
     C*
     C*
     C           @SNDMS    BEGSR
     C                     CALL 'QMHSNDPM'                  * PGM TO SND PGM MSG
     C                     PARM           MSGID             * MESSAGE ID
     C                     PARM           MSGF              * MESSAGE FILE
     C                     PARM           MSGDTA            * MESSAGE DATA
     C                     PARM           MSGLEN            * MESSAGE DATA
     C                     PARM           MSGTYP            * MESSAGE DATA
     C                     PARM           MSGQUE            * MESSAGE DATA
     C                     PARM           MSGCTR            * MESSAGE DATA
     C                     PARM           MSGKEY            * MESSAGE DATA
     C                     PARM           APIERR
     C                     ENDSR
     C*
     C*
     C           @F02SR    BEGSR                            * F2 SUBROUTINE
     C                     SETON                         40 * PROTECT UNTIL F6
     C                     SETOF                       3950 * ERROR IND. SC 1
     C                     SETOF                     515253 * ERROR IND. SC 1
     C                     SETOF                     545556 * ERROR IND. SC 1
     C                     RESETFRSADR                      * REFRESH SCREEN -
     C                     MOVEL20        DOFYR
     C                     MOVE UYEAR     DOFYR
     C                     Z-ADDUMONTH    DOFMON            * SET ERR MESSAGE
     C                     Z-ADDUDAY      DOFDAY            * SET ERR MESSAGE
     C                     MOVE 'X'       COSECO
     C                     MOVE 01        TCKETS
     C                     EXSR @RMVMS
     C                     ENDSR
     C*
     C*
     C           @F03SR    BEGSR                            * F3 SUBROUTINE
     C                     MOVE @TRUE     @EXIT             * SET EXIT FLAG ON
     C                     ENDSR
     C*
     C*
     C           @F04SR    BEGSR                            * F3 SUBROUTINE
     C                     MOVE '   '     FCITYI  3
     C                     MOVE '   '     FCITYA  3
     C                     CALL 'FRS402'                    * SELCT START INTRVL
     C                     PARM           FCITY             * RETURN START TIME
     C                     PARM           FCITYI            * RETURN START TIME
     C                     PARM           FCITYA            * RETURN START TIME
     C                     ENDSR
     C*
     C*
     C           @F05SR    BEGSR                            * F3 SUBROUTINE
     C                     MOVE '   '     TCITYI  3
     C                     CALL 'FRS403'                    * SELCT START INTRVL
     C                     PARM           TCITY             * RETURN START TIME
     C                     PARM           TCITYI            * RETURN START TIME
     C                     EXSR @ERRCK
     C                     ENDSR
     C*
     C*
     C           @F06SR    BEGSR                            * F3 SUBROUTINE
     C*
     C                     SETON                         39 * PROTECT LEFT
     C                     SETOF                         40 * UNPROTECT RIGHT
     C*
     C                     MOVE *BLANKS   DSDOWK
     C                     CALL 'RTDOFW'                    * SELCT START INTRVL
     C                     PARM           DOFMON            * RETURN START TIME
     C                     PARM           DOFDAY            * RETURN START TIME
     C                     PARM           DOFYR             * RETURN START TIME
     C                     PARM           DSDOWK            * RETURN START TIME
     C           ' '       CHEKRDSDOWK    DSDOWL            * SET ERR MESSAGE
     C*
     C                     MOVE *BLANKS   DSFRC             * SET ERR MESSAGE
     C           ' '       CHEKRFCITY     DSFRL             * SET ERR MESSAGE
     C                     MOVELFCITY     DSFRC             * SET ERR MESSAGE
     C*
     C                     MOVE *BLANKS   DSTOC             * SET ERR MESSAGE
     C           ' '       CHEKRTCITY     DSTOL             * SET ERR MESSAGE
     C                     MOVELTCITY     DSTOC             * SET ERR MESSAGE
     C*
     C                     Z-ADD0         FLGT09            * RETURN START TIME
     C*
     C                     CALL 'FRS404'                    * SELCT START INTRVL
     C                     PARM           FLGHTK            * RETURN START TIME
     C                     PARM           FLTPRM  70        * RETURN START TIME
     C                     PARM           DPTIMA            * RETURN START TIME
     C                     PARM           ARTIMA            * RETURN START TIME
     C                     PARM           AIRLNA            * RETURN START TIME
     C                     PARM           PRICEA            * RETURN START TIME
     C*
     C           FLTPRM    IFEQ 0
     C                     SETOF                         39 * PROTECT LEFT
     C                     SETON                         40 * UNPROTECT RIGHT
     C                     GOTO ENDF06
     C                     ENDIF
     C*
     C                     Z-ADDFLTPRM    FLIGHT            * SET ERR MESSAGE
     C                     MOVELDPTIM8    DPTIME            * SET ERR MESSAGE
     C                     MOVELARTIM8    ARTIME            * SET ERR MESSAGE
     C                     MOVELAIRLN3    AIRLIN            * SET ERR MESSAGE
     C                     Z-ADD0.00      PRICE             * RETURN START TIME
     C                     MOVE PRICEN    PRICE             * RETURN START TIME
     C           PRICEL    IFEQ 2                           * RETURN START TIME
     C           PRICE     MULT 10        PRICE             * RETURN START TIME
     C                     ELSE
     C           PRICE     MULT 100       PRICE             * RETURN START TIME
     C                     ENDIF
     C*
     C                     Z-ADD0         ADJPRC
     C           COSFIR    IFNE ' '                         * RUN INTERACTIVE
     C           PRICE     MULT 3         ADJPRC
     C                     ENDIF
     C           COSBUS    IFNE ' '                         * RUN INTERACTIVE
     C           PRICE     MULT 2         ADJPRC
     C                     ENDIF
     C           COSECO    IFNE ' '                         * RUN INTERACTIVE
     C                     Z-ADDPRICE     ADJPRC
     C                     ENDIF
     C*
     C           TCKETS    IFGE 01                          * RUN INTERACTIVE
     C                     Z-ADDADJPRC    PRICE
     C           TCKETS    MULT PRICE     PRICE
     C           PRICE     MULT .04       TAXDUE
     C           PRICE     ADD  TAXDUE    TOTAL
     C                     END
     C*
     C           ENDF06    ENDSR
     C*
     C*
     C           @F07SR    BEGSR                            * F3 SUBROUTINE
     C                     Z-ADD0         CUST#   90        * RETURN START TIME
     C                     CALL 'FRS405'                    * SELCT START INTRVL
     C                     PARM           CUST#             * RETURN START TIME
     C                     PARM           CUSNAM            * RETURN START TIME
     C                     EXSR @ERRCK
     C                     ENDSR
     C*
     C*
     C           @F09SR    BEGSR                            * F9 SUBROUTINE
     C                     CALL 'QUSCMDLN'                  * GET CMD LINE
     C                     ENDSR
     C*
     C*
     C           @F10SR    BEGSR                            * F10 SUBROUTINE
     C*
     C           ORDRKY    SETLLNXTNUM
     C                     READ NXTNUM                 4748
     C*
     C                     CALL 'MSGPRG'
     C*
     C           CUST#     IFEQ 0
     C                     MOVE *BLANKS   CUSTKY            * SET ERR MESSAGE
     C           ' '       CHEKRCUSNAM    CUSTLN            * SET ERR MESSAGE
     C                     MOVELCUSNAM    CUSTNM            * SET ERR MESSAGE
     C           CUSTKY    CHAINCUSTNAME             44
     C           *IN44     IFEQ @ON
     C                     READ CUSTOMER               4748
     C           CNUMBR    ADD  1         CNUMBR
     C                     EXCPTADDCUS
     C                     Z-ADDCNUMBR    CUST#
     C                     ELSE
     C                     Z-ADDCNNMBR    CUST#
     C                     ENDIF
     C                     ENDIF
     C*
     C                     SELEC                            * PRCSS RANDOM NO
     C           COSFIR    WHNE ' '
     C                     MOVE '1'       CLASSN            * SET ERR MESSAGE
     C           COSBUS    WHNE ' '
     C                     MOVE '2'       CLASSN            * SET ERR MESSAGE
     C           COSECO    WHNE ' '
     C                     MOVE '3'       CLASSN            * SET ERR MESSAGE
     C                     ENDSL
     C                     Z-ADD1         CLASSL            * SET ERR MESSAGE
     C*
     C                     Z-ADDTCKETS    TCKET#  90
     C*
     C                     MOVE DOFYR     TSYY              * SET ERR MESSAGE
     C                     MOVE DOFMON    TSMM              * SET ERR MESSAGE
     C                     MOVE DOFDAY    TSDD              * SET ERR MESSAGE
     C                     MOVELDPTIME    DSDPTT            * SET ERR MESSAGE
     C           DSAMPM    IFEQ 'PM'
     C           DSDPHH    ANDNE12                          * SET ERR MESSAGE
     C           DSDPHH    ADD  12        DSDPHH            * SET ERR MESSAGE
     C                     ENDIF
     C                     MOVE DSDPHH    TSHH              * SET ERR MESSAGE
     C                     MOVE DSDPMM    TSMN              * SET ERR MESSAGE
     C*
     C           NXTORD    ADD  1         NXTORD
     C                     UPDATNXTNUM
     C                     Z-ADDNXTORD    ORDER#
     C                     EXCPTADDORD
     C*
     C                     MOVE 'N'       ENDYN   1         * RETURN START TIME
     C                     CALL 'FRS406'                    * SELCT START INTRVL
     C                     PARM           ORDER#            * RETURN START TIME
     C                     PARM           ENDYN             * RETURN START TIME
     C           ENDYN     IFEQ 'Y'
     C                     MOVE @TRUE     @EXIT
     C                     ENDIF
     C*
     C                     Z-ADD0         ORDER#  90
     C                     Z-ADD0         CUST#
     C*
     C           F10END    ENDSR
     C*
     C*
     C           @F12SR    BEGSR
     C                     MOVE @TRUE     @EXIT
     C                     ENDSR
     C*
     OCUSTOMEREADD             ADDCUS
     O                         CNUMBR     4B
     O                         CUSTKY    70
     O*
     O*XTNUM  E                UPDNXT
     O*                        ORDER#     9
     O*
     OORDERS  EADD             ADDORD
     O                         ORDER#     4B
     O                         AGENT#     8B
     O                         CUST#     12B
     O                         FLIGHT    16B
     O                         TSDPRT    42
     O                         TCKET#    46B
     O                         CLASSK    49
     O                         SENDSK    67
