     A          R CUSTR                     PFILE(CUSTOMERS)
     A            CNUMBR                    RENAME(CUSTO00001)
     A            CUSTNM                    RENAME(CUSTO00002)
     A          K CNUMBR                    DESCEND
